<script>
import { directive as OnClickaway } from 'vue-clickaway2';

export default {
  name: 'Popup',
  directives: {
    OnClickaway,
  },
  props: {
    show: {
      type: Boolean,
      default: false,
    },
  },

  updated() {
    console.log(this.show);
  }
};
</script>

<template>
  <div
    :class="{
      active: show,
    }"
    class="popup"
  >
    <div class="popup__wrapper">
      <div
        v-on-clickaway="() => $emit('close')"
        class="popup__content"
      >
        <div
          class="popup__close"
          @click="$emit('close')"
        ></div>
        <h2 class="popup__title">СОГЛАСИЕ НА ОБРАБОТКУ ПЕРСОНАЛЬНЫХ ДАННЫХ ПОСЕТИТЕЛЕЙ САЙТА</h2>
        <div class="popup__text">
          <ol>
            <li>
              <p>
                Пользователь, проходя регистрацию на Сайте
                <a href="https://kia.ru/">https://kia.ru/</a>, принимает настоящее Согласие на
                обработку персональных данных (далее – Согласие).
              </p>
              <p>
                Действуя свободно, своей волей и в своем интересе, а также подтверждая свою
                дееспособность, Пользователь дает свое согласие Общество с ограниченной
                ответственностью «Киа Моторс Россия и СНГ» (ООО «КМР и СНГ») зарегистрированному по
                адресу 115054, г. Москва, ул. Валовая, д. 26 (далее — Оператор) на обработку своих
                персональных данных со следующими условиями:
              </p>
            </li>
            <li>
              <p>Данное Согласие дается на автоматизированную обработку персональных данных.</p>
              <p>Согласие дается на обработку следующих моих персональных данных:</p>
              <ol class="ol_bracket">
                <li>Специальные категории персональных данных – не обрабатываются.</li>
                <li>Биометрические персональные данные – не обрабатываются.</li>
                <li>
                  Персональные данные, не являющиеся специальными или биометрическими:<br>
                  фамилия, имя, отчество; номер телефона; адрес электронной почты; пол; семейное
                  положение; дата рождения; адрес места жительства, образ жизни и поведение субъекта
                  (в том числе, в сети Интернет), сфера деятельности, место работы и должность (род
                  занятий), иные данные и информация, предоставленные и предоставляемые субъектом или
                  ставшие известными ООО «КМР и СНГ» в целях, указанных в настоящем согласии.
                </li>
              </ol>
            </li>
            <li>
              <p>
                Настоящее Согласие дается на выполнение следующих действий (операций), совершаемых с
                использованием средств автоматизации или без использования таких средств с
                персональными данными: сбор, запись, систематизация, накопление, хранение, уточнение
                (обновление, изменение), извлечение, использование, передача, в том числе
                трансграничная (распространение в случаях и в объеме, предусмотренных
                законодательством РФ, в том числе предоставление в государственные органы и иные
                организации), деперсонализация, блокирование, удаление, уничтожение персональных
                данных в целях:
              </p>
              <ol class="ol_latin">
                <li>продвижения и совершенствование товаров и услуг бренда KIA;</li>
                <li>
                  получения и исследования статистических данных об объемах продаж и качестве услуг
                  бренда KIA;
                </li>
                <li>
                  изучения конъюнктуры рынка автомобилей, автомобильных запасных частей и аксессуаров;
                </li>
                <li>
                  сбора статистики по посетителям Сайта для улучшения качества работы Сайта и его
                  содержания;
                </li>
                <li>
                  осуществления других видов деятельности в рамках законодательства РФ с обязательным
                  выполнением требований законодательства РФ в области персональных данных.
                </li>
                <li>
                  сбора данных по поведению на сайте kia.ru (сервисами веб-аналитики, метрическими
                  программами). Подробная информация приведена на официальном сайте ООО «КМР и СНГ» в
                  разделе в разделе «Правовая информация» на странице «Файлы Cookie и анализ посещения
                  сайта» <a href="https://www.kia.ru/info/cookie/">https://www.kia.ru/info/cookie/</a>
                </li>
              </ol>
              <p>При обработке персональных данных и информации в целях, не связанных с направлением
                информации рекламного характера, могут использоваться e-mail рассылка (направление
                сообщений на электронную почту), СМС-рассылка (служба коротких сообщений), почтовая
                рассылка, телефонные звонки, любые иные средства связи, сеть Интернет. Для целей
                направления информации рекламного характера могут использоваться только варианты
                связи, отмеченные выше, либо на которые отдельно дано согласие.</p>
            </li>
            <li>
              Основанием для обработки персональных данных является: ст. 24 Конституции Российской
              Федерации; настоящее Согласие на обработку персональных данных.
            </li>
            <li>
              Оператор персональных данных ведет деятельность на территории Российской Федерации в
              соответствии с законодательством Российской Федерации. Предлагаемые товары/работы/услуги
              доступны к получению на территории Российской Федерации. Мониторинг потребительского
              поведения субъектов, находящихся за пределами Российской Федерации, не ведется.
            </li>
            <li>
              Обработка персональных данных может быть прекращена по запросу субъекта персональных
              данных. Хранение персональных данных, зафиксированных на бумажных носителях,
              осуществляется согласно Федеральному закону №125-ФЗ «Об архивном деле в Российской
              Федерации» и иным нормативно правовым актам в области архивного дела и архивного
              хранения.
            </li>
            <li>
              Согласие может быть отозвано субъектом персональных данных или его представителем путем
              направления письменного заявления заказным письмом с уведомлением Оператору по адресу,
              указанному в начале данного Согласия.
            </li>
            <li>
              В случае отзыва субъектом персональных данных или его представителем согласия на
              обработку персональных данных Оператор вправе продолжить обработку персональных данных
              без согласия субъекта персональных данных при наличии оснований, указанных в пунктах 2 –
              11 части 1 статьи 6, части 2 статьи 10 и части 2 статьи 11 Федерального закона №152-ФЗ
              «О персональных данных» от 27.07.2006 г.
            </li>
            <li>
              Настоящее согласие действует с момента проставления отметки и до момента прекращения
              обработки персональных данных, указанных в п.7 и п.8 данного Согласия.
            </li>
            <li>
              Политика обработки данных ООО «КМР и СНГ», а также описание прав субъекта персональных
              данных и возможности их реализации приведены на официальном сайте ООО «КМР и СНГ» в
              разделе «Правовая информация»
              <a href="https://www.kia.ru/info/">https://www.kia.ru/info/</a></li>
          </ol>
        </div>
      </div>
    </div>
  </div>
</template>

<style lang="scss" scoped>
.popup {
  position: fixed;
  z-index: 100;
  top: 0;
  left: 0;
  display: flex;
  justify-content: center;
  align-items: center;
  width: 100%;
  height: 100%;
  opacity: 0;
  background: rgba(0, 0, 0, .7);
  visibility: hidden;
  transition: .25s opacity, .25s visibility;
  $root: &;

  &.active {
    opacity: 1;
    visibility: visible;

    #{$root} {
      &__content {
        transform: none;
      }
    }
  }

  &__wrapper {
    display: flex;
    flex-direction: column;
    justify-content: flex-start;
    align-items: center;
    width: 100%;
    max-height: 100%;
    padding: 60px 0;
    overflow: auto;
    @include no-scrollbar;
  }

  &__content {
    position: relative;
    width: 100%;
    max-width: 840px;
    padding: 80px 100px 100px;
    background: white;
    transition: .35s transform cubic-bezier(.77, 1.8, .71, .75);
    transform: scale(.99);
  }

  &__close {
    position: absolute;
    top: 25px;
    right: 25px;
    width: 25px;
    height: 25px;
    cursor: pointer;

    &::before,
    &::after {
      position: absolute;
      content: '';
      top: 50%;
      left: 50%;
      width: 100%;
      height: 2px;
      background: #707070;
      transition: .25s;
    }

    &::before {
      transform: translate(-50%, -50%) rotate(-45deg);
    }

    &::after {
      transform: translate(-50%, -50%) rotate(45deg);
    }

    &:hover {
      &::before,
      &::after {
        width: calc(100% + 2px);
        background: black;
      }
    }
  }

  &__title {
    position: relative;
    padding-bottom: 30px;
    border-bottom: 1px solid #ccc;
    margin-bottom: 30px;
    font-size: 32px;

    &:last-child {
      margin-bottom: 0;
    }
  }

  &__text {
    font-size: 15px;
    line-height: 167%;

    a {
      display: inline;

      &:hover {
        text-decoration: underline;
      }
    }

    ol {
      padding-left: 15px;
      margin-bottom: 15px;

      &:last-child {
        margin-bottom: 0;
      }

      li {
        margin-bottom: 15px;

        &:last-child {
          margin-bottom: 0;
        }
      }

      &.ol_bracket {
        list-style: none;
        counter-reset: bracket;

        li {
          position: relative;

          &::before {
            position: absolute;
            content: counter(bracket) ")";
            left: -15px;
            counter-increment: bracket;
          }
        }
      }

      &.ol_latin {
        list-style: none;
        counter-reset: latin;

        li {
          position: relative;

          &::before {
            position: absolute;
            content: counter(latin, lower-latin) ")";
            left: -15px;
            counter-increment: latin;
          }
        }
      }
    }
  }
}
</style>
